<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"9807ace4d352b6f2af57ddb2dd5aba6a696d83ac935c3cd5ceb415a5bde6ed14","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #736 at https://github.com/cal-itp/data-infra/actions/runs/18177877098","plan_out_hash":"ad58860ebe77183cdfa48b0dc9187522eb201c8cb91ad69c34468775a3a87313","plan_hash":"8931a5383171e268d074ea38dd5d1a9550599aa3257cb880776c70aeaf40709a","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 1 to add, 5 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "ACattQ==" -> (known after apply)
!~      detect_md5hash      = "i3GChqIw2WJRtxG568o2lA==" -> "different hash"
!~      generation          = 1759338103959628 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "i3GChqIw2WJRtxG568o2lA==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/gtfs_quality/int_gtfs_quality__schedule_validator_rule_details_unioned.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "FZrGzA==" -> (known after apply)
!~      detect_md5hash      = "xTWjkGqqzCqWNDhJxp6R/w==" -> "different hash"
!~      generation          = 1749663120395357 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/gtfs_quality/int_gtfs_quality__schedule_validator_rule_details_unioned.sql"
!~      md5hash             = "xTWjkGqqzCqWNDhJxp6R/w==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs_quality/int_gtfs_quality__schedule_validator_rule_details_unioned.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs_quality/_mart_gtfs_quality.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "Rs71zQ==" -> (known after apply)
!~      detect_md5hash      = "rnq255v0R46m5jQzuY/z0g==" -> "different hash"
!~      generation          = 1749663113676778 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs_quality/_mart_gtfs_quality.yml"
!~      md5hash             = "rnq255v0R46m5jQzuY/z0g==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs_quality/_mart_gtfs_quality.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/kuba/fct_kuba__device_properties.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "iFu7+Q==" -> (known after apply)
!~      detect_md5hash      = "C4+qxzOSw2CvXVQpT8sjkw==" -> "different hash"
!~      generation          = 1755538686034105 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/kuba/fct_kuba__device_properties.sql"
!~      md5hash             = "C4+qxzOSw2CvXVQpT8sjkw==" -> (known after apply)
        name                = "data/warehouse/models/mart/kuba/fct_kuba__device_properties.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/ntd_annual_reporting/.DS_Store"] will be destroyed
  # (because key ["models/staging/ntd_annual_reporting/.DS_Store"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "application/octet-stream" -> null
-       crc32c              = "sYtuGQ==" -> null
-       detect_md5hash      = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1759341518465210 -> null
-       id                  = "calitp-staging-composer-data/warehouse/models/staging/ntd_annual_reporting/.DS_Store" -> null
-       md5hash             = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       md5hexhash          = "194577a7e20bdcc7afbb718f502c134c" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fstaging%2Fntd_annual_reporting%2F.DS_Store?generation=1759341518465210&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/staging/ntd_annual_reporting/.DS_Store" -> null
-       output_name         = "data/warehouse/models/staging/ntd_annual_reporting/.DS_Store" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fstaging%2Fntd_annual_reporting%2F.DS_Store" -> null
-       source              = "../../../../warehouse/models/staging/ntd_annual_reporting/.DS_Store" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["seeds/gtfs_schedule_validator_rule_details_v7_1_0.csv"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/seeds/gtfs_schedule_validator_rule_details_v7_1_0.csv"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/seeds/gtfs_schedule_validator_rule_details_v7_1_0.csv"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "k/CfPA==" -> (known after apply)
!~      detect_md5hash      = "vwEHoy+dSUjEVyBTvP71ug==" -> "different hash"
!~      generation          = 1759338105797147 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "vwEHoy+dSUjEVyBTvP71ug==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #736](https://github.com/cal-itp/data-infra/actions/runs/18177877098)